## Plan Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/21128733015)



<pre><code>Plan: 10 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * google_cloud_identity_group_membership.image_builder_group_to_dev_read
  * google_cloud_identity_group_membership.image_builder_group_to_dev_write
  * google_cloud_identity_group_membership.image_builder_group_to_prod_read
  * google_cloud_identity_group_membership.image_builder_group_to_prod_write
  * google_cloud_identity_group_membership.image_builder_restricted_markets_sa_to_hierarchical_group
  * google_cloud_identity_group_membership.markets_delivery_group_to_prod_read
  * google_cloud_identity_group_membership.markets_delivery_sa_to_hierarchical_group
  * google_cloud_identity_group_membership.security_scanners_group_to_dev_read
  * google_cloud_identity_group_membership.security_scanners_group_to_prod_read
  * google_cloud_identity_group_membership.security_scanners_sa_to_hierarchical_group
* Update
  * module.signify_secret_rotator.google_cloud_run_service.signify_secret_rotator



<details><summary>Change Result (Click me)</summary>

```hcl

  # google_cloud_identity_group_membership.image_builder_group_to_dev_read will be created
  + resource "google_cloud_identity_group_membership" "image_builder_group_to_dev_read" {
      + create_time = (known after apply)
      + group       = "groups/0184mhaj2tdduaw"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "kyma-restricted-registry-image-builder@sap.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

  # google_cloud_identity_group_membership.image_builder_group_to_dev_write will be created
  + resource "google_cloud_identity_group_membership" "image_builder_group_to_dev_write" {
      + create_time = (known after apply)
      + group       = "groups/023ckvvd0rmgw6a"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "kyma-restricted-registry-image-builder@sap.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

  # google_cloud_identity_group_membership.image_builder_group_to_prod_read will be created
  + resource "google_cloud_identity_group_membership" "image_builder_group_to_prod_read" {
      + create_time = (known after apply)
      + group       = "groups/00xvir7l1dtv8ew"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "kyma-restricted-registry-image-builder@sap.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

  # google_cloud_identity_group_membership.image_builder_group_to_prod_write will be created
  + resource "google_cloud_identity_group_membership" "image_builder_group_to_prod_write" {
      + create_time = (known after apply)
      + group       = "groups/01egqt2p1a2johw"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "kyma-restricted-registry-image-builder@sap.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

  # google_cloud_identity_group_membership.image_builder_restricted_markets_sa_to_hierarchical_group will be created
  + resource "google_cloud_identity_group_membership" "image_builder_restricted_markets_sa_to_hierarchical_group" {
      + create_time = (known after apply)
      + group       = "groups/01fob9te0l19xwg"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "img-builder-restricted-markets@kyma-project.iam.gserviceaccount.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

  # google_cloud_identity_group_membership.markets_delivery_group_to_prod_read will be created
  + resource "google_cloud_identity_group_membership" "markets_delivery_group_to_prod_read" {
      + create_time = (known after apply)
      + group       = "groups/00xvir7l1dtv8ew"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "kyma-restricted-registry-markets-delivery@sap.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

  # google_cloud_identity_group_membership.markets_delivery_sa_to_hierarchical_group will be created
  + resource "google_cloud_identity_group_membership" "markets_delivery_sa_to_hierarchical_group" {
      + create_time = (known after apply)
      + group       = "groups/03fwokq04jj0scm"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "restricted-markets-reg-reader@sap-kyma-prow.iam.gserviceaccount.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

  # google_cloud_identity_group_membership.security_scanners_group_to_dev_read will be created
  + resource "google_cloud_identity_group_membership" "security_scanners_group_to_dev_read" {
      + create_time = (known after apply)
      + group       = "groups/0184mhaj2tdduaw"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "kyma-restricted-registry-security-scanners@sap.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

  # google_cloud_identity_group_membership.security_scanners_group_to_prod_read will be created
  + resource "google_cloud_identity_group_membership" "security_scanners_group_to_prod_read" {
      + create_time = (known after apply)
      + group       = "groups/00xvir7l1dtv8ew"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "kyma-restricted-registry-security-scanners@sap.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

  # google_cloud_identity_group_membership.security_scanners_sa_to_hierarchical_group will be created
  + resource "google_cloud_identity_group_membership" "security_scanners_sa_to_hierarchical_group" {
      + create_time = (known after apply)
      + group       = "groups/00meukdy10z0qky"
      + id          = (known after apply)
      + name        = (known after apply)
      + type        = (known after apply)
      + update_time = (known after apply)

      + preferred_member_key {
          + id = "kyma-security-scanners@sap-kyma-prow.iam.gserviceaccount.com"
        }

      + roles {
          + name = "MEMBER"
        }
    }

  # module.signify_secret_rotator.google_cloud_run_service.signify_secret_rotator will be updated in-place
  ~ resource "google_cloud_run_service" "signify_secret_rotator" {
        id                         = "locations/europe-west4/namespaces/sap-kyma-prow/services/signify-secret-rotator"
        name                       = "signify-secret-rotator"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "europe-docker.pkg.dev/kyma-project/prod/test-infra/signify-secret-rotator:v20251113-b9e254cf" -> "europe-docker.pkg.dev/kyma-project/prod/test-infra/signify-secret-rotator:v20260105-83175583"
                    # (2 unchanged attributes hidden)

                    # (6 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 10 to add, 1 to change, 0 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

OpenTofu detected the following changes made outside of OpenTofu since the
last "tofu apply" which may have affected this plan:

  # module.dev_docker_repository.google_artifact_registry_repository.protected_repository[0] has changed
  ~ resource "google_artifact_registry_repository" "protected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/dev"
        name                   = "dev"
      ~ update_time            = "2026-01-17T07:47:57.750164Z" -> "2026-01-19T07:21:35.591699Z"
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.dev_kyma_modules.google_artifact_registry_repository.unprotected_repository[0] has changed
  ~ resource "google_artifact_registry_repository" "unprotected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/dev-kyma-modules"
        name                   = "dev-kyma-modules"
      ~ update_time            = "2026-01-16T15:07:05.787068Z" -> "2026-01-19T07:20:10.565781Z"
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.docker_cache.google_artifact_registry_repository.unprotected_repository[0] has changed
  ~ resource "google_artifact_registry_repository" "unprotected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/cache"
        name                   = "cache"
      ~ update_time            = "2026-01-17T07:48:38.043104Z" -> "2026-01-19T07:21:00.192605Z"
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.dockerhub_mirror.google_artifact_registry_repository.unprotected_repository[0] has changed
  ~ resource "google_artifact_registry_repository" "unprotected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/dockerhub-mirror"
        name                   = "dockerhub-mirror"
      ~ update_time            = "2026-01-17T05:44:53.123685Z" -> "2026-01-19T07:18:47.328063Z"
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.prod_docker_repository.google_artifact_registry_repository.protected_repository[0] has changed
  ~ resource "google_artifact_registry_repository" "protected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/prod"
        name                   = "prod"
      ~ update_time            = "2026-01-17T03:38:30.532468Z" -> "2026-01-19T07:20:23.372994Z"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>







<!-- github-comment: {"Command":"plan","JobName":"pull-plan-prod-terraform","PRNumber":13741,"Program":"tfcmt","SHA1":"e59d84e93aa3151c6b5c409c4d210308b3b6f008","Vars":{},"WorkflowName":"workflow-controller-pull-requests"} -->